package com.zhixinyisheng.user.domain.doctor;

/**
 * Created by 风度侠客 on 2016/12/28.
 */

public class AreaConstant {
    public static String[] JOB_NAMED = new String[]{"全部职称", "住院医师", "主治医师", "副主任医师", "主任医师"};
    public static String[] PROVINCE = new String[]{"全部", "北京", "江苏", "安徽", "浙江", "山东",
            "福建", "上海", "广东", "广西", "海南", "湖南", "湖北", "河南", "江西", "天津", "内蒙古",
            "河北", "山西", "宁夏", "新疆", "青海", "陕西", "甘肃", "四川", "云南", "贵州", "重庆",
            "西藏", "辽宁", "黑龙江", "吉林", "香港", "澳门", "台湾"};
    // 地级选项值
    public static String[][] CITY = new String[][]{
            {"全部"},
            {"全部","北京"},

            {"全部","南京", "常州", "扬州", "徐州", "无锡", "连云港", "盐城", "淮安", "宿迁",
                    "镇江", "南通", "泰州", "苏州", "淮阴"},

            {"全部","合肥", "芜湖", "亳州", "马鞍山", "池州", "淮南", "淮北", "蚌埠", "巢湖",
                    "安庆", "宿州", "宣城", "阜阳", "滁州", "黄山", "铜陵", "六安", "贵池"},

            {"全部","杭州", "温州", "湖州", "嘉兴", "台州", "金华", "舟山", "衢州", "丽水",
                    "绍兴", "宁波"},

            {"全部","潍坊", "淄博", "威海", "枣庄", "泰安", "临沂", "东营", "济宁", "烟台",
                    "菏泽", "日照", "德州", "滨州", "青岛", "聊城", "莱芜"},

            {"全部","福州", "泉州", "漳州", "南平", "三明", "龙岩", "莆田", "宁德", "厦门"},

            {"全部","上海"},

            {"全部","广州", "江门", "佛山", "汕头", "湛江", "韶关", "中山", "珠海", "茂名",
                    "肇庆", "阳江", "惠州", "潮州", "梅州", "揭阳", "清远", "河源", "东莞", "汕尾",
                    "云浮", "深圳", "番禺", "花都", "从化"},

            {"全部","南宁", "贺州", "柳州", "桂林", "梧州", "北海", "玉林", "钦州", "百色",
                    "防城港 ", "贵港", "河池", "来宾", "崇左"},

            {"全部","海口"},

            {"全部","长沙", "郴州", "娄底", "衡阳", "株洲", "湘潭", "岳阳", "常德", "邵阳",
                    "益阳", "永州", "张家界", "怀化", "吉首", "湘西"},

            {"全部","武汉", "恩施", "襄阳", "荆门", "江汉", "咸宁", "襄樊", "荆州", "黄石",
                    "宜昌", "随州", "鄂州", "孝感", "黄冈", "十堰", "神农架", "仙桃", "潜江"},

            {"全部","郑州", "洛阳", "焦作", "商丘", "信阳", "新乡", "安阳", "开封", "漯河",
                    "南阳", "鹤壁", "平顶山", "濮阳", "许昌", "周口", "三门峡", "驻马店",
                    "济源"},

            {"全部","南昌", "赣州", "景德镇", "九江", "萍乡", "新余", "抚州", "宜春", "上饶",
                    "鹰潭", "吉安"},

            {"全部","天津"},
            {"全部","呼和浩特 ", "呼伦贝尔市 ", "包头", "赤峰 ", "乌海", "通辽", "鄂尔多斯 ",
                    "乌兰察布", "阿拉善盟", "临河", "巴彦浩特", "巴彦淖尔盟", "兴安盟", "锡林浩特",
                    "乌兰浩特", "阿拉善左旗", "呼伦贝尔", "兴安", "阿拉善", "海拉尔", "锡林郭勒",
                    "锡林郭勒盟"},

            {"全部","石家庄", "保定", "秦皇岛", "唐山", "邯郸", "邢台", "沧州", "承德", "廊坊",
                    "衡水", "张家口"},

            {"全部","太原", "大同", "阳泉", "长治", "临汾", "晋中", "运城", "晋城", "忻州",
                    "朔州", "吕梁"},

            {"全部","银川", "固原", "吴忠", "石嘴山", "中卫"},

            {"全部","乌鲁木齐", "昌吉", "石河子", "库尔勒", "喀什", "吐鲁番", "哈密", "阿克苏",
                    "奎屯", "博乐", "伊犁", "克拉玛依", "阿图什", "和田", "塔城", "阿勒泰", "克孜勒苏",
                    "克州", "塔城地区", "博州", "博尔塔拉", "巴音郭楞"},

            {"全部","西宁", "格尔木", "海东", "海南州", "海北州", "海西州", "玉树", "果洛",
                    "黄南", "德令哈", "海西", "海北", "海南", "海晏", "共和", "同仁", "玛沁"},

            {"全部","西安", "咸阳", "榆林", "宝鸡", "铜川", "渭南", "汉中", "安康", "商洛",
                    "延安", "商州"},

            {"全部","兰州", "白银", "武威", "金昌", "平凉", "张掖", "嘉峪关", "酒泉", "庆阳",
                    "定西", "陇南", "天水", "临夏", "甘南", "西峰", "武都"},


            {"全部","成都", "乐山", "雅安", "广安", "南充", "自贡", "泸州", "内江", "宜宾",
                    "广元", "达州", "资阳", "绵阳", "眉山", "德阳", "甘孜", "阿坝", "巴中",
                    "甘孜州", "凉山", "马尔康", "康定", "凉山(西昌)"},
            {"全部","昆明", "红河", "楚雄", "曲靖", "玉溪", "大理", "丽江", "文山", "普洱",
                    "保山", "临沧", "怒江", "德宏", "版纳", "迪庆", "昭通", "西双版纳", "中甸",
                    "个旧", "景洪", "六库", "潞西", "思茅"},

            {"全部","贵阳", "安顺", "遵义", "六盘水", "铜仁", "凯里", "都匀", "兴义", "毕节",
                    "黔西南", "黔南", "黔东南"},

            {"全部","重庆"},

            {"全部","拉萨", "阿里", "日喀则", "山南", "林芝", "昌都", "那曲"},

            {"全部","沈阳", "盘锦", "鞍山", "抚顺", "本溪", "铁岭", "锦州", "丹东", "辽阳",
                    "葫芦岛", "阜新", "朝阳", "营口", "大连"},

            {"全部","哈尔滨", "伊春", "牡丹江", "大庆", "鸡西", "鹤岗", "绥化", "双鸭山",
                    "七台河", "佳木斯", "黑河", "齐齐哈尔", "大兴安岭"},

            {"全部","长春", "通化", "白城", "四平", "辽源", "松原", "白山", "延吉", "吉林",
                    "梅河口", "珲春", "延边"}, {"香港"}, {"澳门"}, {"台湾"}};
}
